# running in config_cover/src/
read -formal mkAccumulator_formal.v
prep -top mkAccumulator_formal
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
