# running in spb_cv/src/
read_verilog -formal single_port_bram.v
prep -top single_port_bram
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
