# running in config_prove/src/
read -formal systolic_multiplier_fsm.v
prep -top systolic_multiplier_fsm
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
