# running in clz_pro/src/
read -formal ./nibble_local_count.v
read -formal ./boundary_nibble_encoder.v
read -formal ./count_leading_zeros.v
prep -top count_leading_zeros
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
