# running in SSD_prove/src/
read -formal ./ssd_driver_formal.v
prep -top ssd_driver_formal
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
