# running in dpr/src/
read_verilog -formal dual_port_bram.v
prep -top dual_port_bram
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
