# running in fixed_point_macc/src/
read -formal ./fixed_point_macc.v
prep -top fixed_point_macc
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
