# running in config_prove/src/
read -formal systolic_mult_cell.v
read -formal full_adder.v
prep -top systolic_mult_cell
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
