# running in DCD/src/
read_verilog -formal dynamic_clock_divider.v
prep -top dynamic_clock_divider
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
