# running in vtc/src/
read_verilog -formal video_timing_controller.v
prep -top video_timing_controller
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
