# running in sfifo_prove/src/
read -formal ./sync_fifo.v
prep -top sync_fifo
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
