# running in SCD/src/
read_verilog -formal static_clock_divider_formal.v
prep -top static_clock_divider_formal
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
