# running in tx_formal_prove/src/
read -formal ./uart_transmitter.v
prep -top uart_transmitter
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
